Revit 2027 API
BuiltInFailures.LevelFailures.StoryAboveNonStoryLevel Property
 The level set as the Story Above for these levels is no longer a story level. This change will cause these levels to revert to the default Story Above.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId StoryAboveNonStoryLevel { get; }
Public Shared ReadOnly Property StoryAboveNonStoryLevel As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ StoryAboveNonStoryLevel {
	FailureDefinitionId^ get ();
}
static member StoryAboveNonStoryLevel : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.LevelFailures Class
Autodesk.Revit.DB Namespace